export type DonationProject = {
  id: string;
  title: string;
  description: string;
  image: string;
  amounts: number[];
};

export const donationProjects: DonationProject[] = [
  {
    id: "1",
    title: "إبتسامة حافظ",
    description:
      "مجموعة من معلمي ومعلمات وحفاظ كتاب الله تعالى بحاجة للعلاج والأدوية بأمراض الفم والأسنان، تبرعك يحقق لك الأجر وبعور التلاوة الصحيحة والنطق السليم...",
    image: "/1.jpg",
    amounts: [500, 240, 120],
  },
  {
    id: "2",
    title: "السنابل المضاعفة",
    description:
      "ضاعف أجرك بالمساهمة في ثلاثة مشاريع بتبرع واحد، لدعم المحتاجين من الفقراء والمساكين والأيتام تبرعك يساهم في البرامج التالية: أوقاف ابتسم والصدقة اليوم...",
    image: "/2.jpg",
    amounts: [500, 300, 100],
  },
  {
    id: "3",
    title: "الصدقة اليومية",
    description:
      "صدقتك اليوم .. عن كل يوم. يوميا حسنة والحسنة بعشر أمثالها والله يضاعف لمن يشاء، تصدق بـ ريال واحد عن كل يوم من أيام العام المساهمة في علاج الفقر...",
    image: "/3.jpg",
    amounts: [500, 360, 90],
  },
  {
    id: "4",
    title: "فرحة محتاج",
    description:
      "ساهم في علاج وتوعية المرضى المحتاجين الذين يعجزون عن تحمل التكاليف، بتبرعك تمنحهم الابتسامة التي يستحقونها، وتساعدهم على استعادة صحتهم وكرامتهم.",
    image: "/1.jpg",
    amounts: [500, 300, 50],
  },
  {
    id: "5",
    title: "هدية الوالدين",
    description:
      "ما أعظمها من هدية حين تتصدق عن والديك ترفع بها درجاتهما ومنازلهما في الجنة، برا بهما ورحمة وإحسانا، فهما السبب بعد الله في وجودك في الحياة، وخصهما الـ...",
    image: "/2.jpg",
    amounts: [500, 265, 95],
  },
  {
    id: "6",
    title: "بزكاتك يبتسم",
    description:
      "تطهر الزكاة مال صاحبها وتضاعفه، وتقربه إلى الله تعالى طالما أنه يقدم هذه الزكاة بنفس مؤمنة، طاهرة لرضى الله تعالى.",
    image: "/3.jpg",
    amounts: [],
  },
  {
    id: "7",
    title: "الصدقة الجارية",
    description:
      "الصدقة الجارية من أفضل الصدقات التي لا تنقطع فساهم الآن في صدقة جارية عنك وعن أحد تحب، لدى المحتاجين من الفقراء والمساكين والأيتام ليدوم أجرك ويبقى أثرك.",
    image: "/1.jpg",
    amounts: [300, 100, 50],
  },
  {
    id: "8",
    title: "بسمة يتيم",
    description:
      "أيتام يعانون من ألم المرض وألم الفقد، وليس لديهم ما يكفيهم لعلاجهم وتوعيتهم من المرض.",
    image: "/2.jpg",
    amounts: [500, 300, 100],
  },
  {
    id: "9",
    title: "أوقاف ابتسم",
    description:
      "الوقف أفضل أنواع الصدقات والأعمال الصالحة وأنفعها، ينتظم أثر الوقف من خلال ستة مشاريع وقفية هي: تأسيس وتشغيل عيادات أسنان وقفية ...",
    image: "/3.jpg",
    amounts: [800, 500, 50],
  },
  {
    id: "10",
    title: "الصدقة الجارية للوالدين",
    description:
      "قال رسول الله: إذا مات ابن آدم انقطع عمله إلا من ثلاث: صدقة جارية، أو علم ينتفع به أو ولد صالح يدعو له.",
    image: "/1.jpg",
    amounts: [300, 100, 50],
  },
  {
    id: "11",
    title: "تفريج كربة",
    description:
      "العديد من المرضى من ذوي الحاجة والفقراء يعانون من آلام الأسنان الشديدة، وينتظرون يد العون لتخفيف معاناتهم، بدعمك تمنحهم الابتسامة وتكف...",
    image: "/2.jpg",
    amounts: [],
  },
  {
    id: "12",
    title: "صدقة ليالي رمضان",
    description:
      "في شهر الرحمة، اجعل عطاؤك حياة. ساهم في صدقة ليالي رمضان مع جمعية ابتسم لدعم المحتاجين والأيتام والأوقاف المستدامة...",
    image: "/3.jpg",
    amounts: [],
  },
];
